In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
data=pd.read_csv(r"D:\collage\sem4\ML\Assignement2\train.csv")

In [8]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
data.shape

(891, 12)

In [10]:
# data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
# num_missing = data['Age'].isnull().sum()

# print("Total number of cells with missing value is:", num_missing)

Total number of cells with missing value is: 177

In [14]:
# missing_index = data['Age'][data['Age'].isnull()].index

# index_sum = sum(missing_index)

# print("Sum of the index number of all the cells with missing values:", index_sum)

Sum of the index number of all the cells with missing values: 76921

In [22]:
# data['GenderLabel'] = data['Sex'].apply(lambda x: 1 if x == 'male' else 0)

In [19]:
# from sklearn.model_selection import train_test_split

# X = data[['Pclass', 'GenderLabel', 'Survived']]
# y = data['Age']

# X_train, X_valid, y_train, y_valid = train_test_split(X, y, test_size=0.2, random_state=42)

In [20]:
# df_missing_age = data[data['Age'].isnull()]
# df_valid_age = data[data['Age'].notnull()]

In [23]:
# from sklearn.linear_model import LinearRegression
# linreg = LinearRegression()
# linreg.fit(df_valid_age[['Pclass', 'GenderLabel', 'Survived']], df_valid_age['Age'])
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,GenderLabel
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [25]:
survivors_3rd_class = data.loc[(data['Pclass'] == 3) & (data['Survived'] == 1)]['Survived'].count()
print("Total number of survivors from the 3rd PClass: ", survivors_3rd_class)

Total number of survivors from the 3rd PClass:  119

In [31]:
males_died = data.loc[(data['Sex'] == 'male') & (data['Survived'] == 0)]['Survived'].count()
print("Total number of males who died in the accident: ", males_died)

Total number of males who died in the accident:  468

In [32]:
survivors_southampton = data.loc[(data['Embarked'] == 'S') & (data['Survived'] == 1)]['Survived'].count()

print("Total number of survivors who embarked the ship from Southampton: ", survivors_southampton)

Total number of survivors who embarked the ship from Southampton:  217

In [39]:
# Splitting the dataset into two parts
num_missing = data['Age'].isnull().sum()
not_missing_age = data.dropna(subset=['Age'])


print("Total number of cells with missing value is:", num_missing)

not_missing_age.shape

Total number of cells with missing value is: 0

(891, 13)

In [35]:
# Training a Linear Regression model
reg = LinearRegression().fit(not_missing_age[['Pclass', 'SibSp', 'Parch']], not_missing_age['Age'])

# Predicting the missing values in the 'Age' column
missing_age['Age'] = reg.predict(missing_age[['Pclass', 'SibSp', 'Parch']])

# Merging the two parts of the dataset
data = pd.concat([not_missing_age, missing_age], ignore_index=True)

# Printing the total number of cells with missing values in the Age column
print("Total number of cells with missing values in the Age column: ", data['Age'].isna().sum())

# Printing the sum of the index number of all the cells with missing values
missing_age_index_sum = missing_age.index.values.sum()
print("Sum of the index number of all the cells with missing values: ", missing_age_index_sum)

Total number of cells with missing values in the Age column:  0
Sum of the index number of all the cells with missing values:  76921

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_23392\1199130995.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  missing_age['Age'] = reg.predict(missing_age[['Pclass', 'SibSp', 'Parch']])